package day0422;

public class TestMain {

	public static void main(String[] args) {
//		1. Test Class
//	    1. 이름(name), 전공(major), 학번(studentNumber), 나이(age) 필드를 가지고 있음. 
//	    2. 생성자 
//	        1. 기본생성자 v
//	        2. 이름, 나이만 매개변수로 하는 생성자 v
//	            1. 이름, 나이 필드 값은 매개변수로 전달 받은 값으로 저장하고 
//	            2. 전공은 컴퓨터, 학번은 1234로 저장한다. 
//	        3. 이름, 전공, 학번, 나이를 매개변수로 하는 생성자 
//	            1. 4개의 값을 모두 매개변수로 전달 받아서 필드 값으로 저장함. 
//	2. TestMain Class
//	    1. student1: 기본생성자를 호출하여 생성한 객체 
//	        1. 필드 4개에 대한 값을 각각 입력해보고 출력도 해보세요 
//	    2. student2: 매개변수 2개인 생성자를 호출하여 생성한 객체 
//	        1. 필드 4개에 대한 값을 출력 해보세요 
//	    3. student3: 매개변수 4개인 생성자를 호출하여 생성한 객체 
//	        1. 필드 4개에 대한 값을 출력 해보세요

	
	}

}
